Revit 2027 API
BuiltInFailures.EditingFailures.UnableFilletSpecifiedRadius Property
 Unable to create Fillet with the specified radius.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableFilletSpecifiedRadius { get; }
Public Shared ReadOnly Property UnableFilletSpecifiedRadius As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableFilletSpecifiedRadius {
	FailureDefinitionId^ get ();
}
static member UnableFilletSpecifiedRadius : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace